---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ProjectBuildingType
source: html/f5232203-93e9-7843-f71c-1a5ddae55d6e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ProjectBuildingType Property

"Building Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ProjectBuildingType { get; }
```